club_description = \
    ("(не)Ленкин клуб @lenka_ne_club — это клуб для тех, кто хочет становиться лучше как системный "
     "(инфраструктурный) программист (в противовес продуктовой разработке). \n\n"
     "Обсуждаем распределенные системы, базы данных, data streaming и все, что рядом находится. Фокус — прикладные "
     "знания, которые помогут в работе.")

how_to_join_description = \
    ("Просто вступить в группу и написать интро про себя с хэштегом #whois — чем занимаешься, где "
     "работаешь или учишься, где живешь, в какой активности хочешь участвовать в клубе.\n\n"
     "Клуб держится на доверии и активном участии членов клуба. Когда ты пишешь содержательное "
     "интро о себе, ты даешь возможность другим членам клуба задать тебе вопрос / попросить совета "
     "/ позвать на сходку.\n\n"
     "Интро уже состоящих в клубе людей ты можешь найти по хэштегу #whois. \n\n")

ddia_description = \
    ("14 августа 2025 мы начнем читать Designing Data-Intensive Applications с начала! Подпишись на обновления потока 👇 "
        "и ты будешь получать новости по потоку и ссылку на звонок. "
        "Звонки проходят по четвергам в 18:00 по Берлину, неважно, летнее или зимнее время в Берлине.")

sre_book_description = \
    ("SRE Book — книга про принципы и практики работы Site Reliability Engineer команды в Google. Книга является "
     "сборником эссе от разных авторов, поэтому присоединиться к нам можно в любой момент. "
     "Ссылка на книгу <a href='https://sre.google/sre-book/table-of-contents/'>вот</a>.\n\n"
     "Больше подробностей — <a href='t.me/lenka_ne_club/7272'>в группе</a>. Звонки проходят каждый вторник в 18:00 по "
     "Белграду. Следить за расписанием можно "
     "<a href='https://docs.google.com/spreadsheets/d/1J15WCQyITeDZR64G9Ymf-pT_zSJm3m9Kvorp48ecy10/edit?gid=0#gid=0'>в этой таблице</a>.")

sre_book_cta_description = \
    "Нажми кнопку \"Хочу участвовать\", и бот будет присылать тебе ссылку на Zoom звонок за пять минут до звонка!"

sre_enroll_description = \
    "Бот будет присылать тебе напоминание с ссылкой на Zoom звонок за пять минут до звонка!"

sre_unenroll_description = "Бот больше не будет присылать тебе напоминания о SRE book"

ddia_cta_description = \
    ("Нажми кнопку \"Хочу участвовать\", и бот будет присылать тебе новости о чтении Designing Data Intensive "
     "Applications и ссылку на звонок")

ddia_enroll_description = \
    ("Бот будет присылать тебе новости о чтении Designing Data Intensive Applications и ссылку на звоноки за пять минут"
     " до звонка!")

ddia_unenroll_description = "Бот больше не будет присылать тебе новости о DDIA"

mock_leetcode_description = \
    ("Прорешивать Leetcode — это хорошо, но на реальном собеседовании важно уметь рассказать ход решения, "
     "иногда на английском! В клубе мы практикуемся проходить собеседования в формате, приближенном к реальности.\n\n"
     "Два человека из пары созваниваются в удобное для них время (рассчитывай на полтора часа) и проводят "
     "мок-собеседование. Сначала первый партнер выступает в качестве интервьюера, а второй в качестве кандидата решает "
     "задачу. Потом партнеры меняются местами. Больше подробностей — "
     "<a href='https://t.me/lenka_ne_club/6833/6834'>в закрепленном сообщении</a>!")

how_to_present_description = \
    ("Ура спасибо! Клуб живет за счет волонтеров, которые делают презентации, так что нам это очень кстати!\n\n"
     "Принцип заключается в том, что на обсуждение на звонках приходят только те люди, кто уже сам прочитал главу, "
     "так что твоя презентация не должна покрывать и пересказывать всю главу. Ты можешь сосредоточиться только на "
     "том, что особенно тебя заинтересовало!\n\n"
     "➡️ Что если я прочитала главу, но не поняла ее полностью? Отлично, для того мы и ходим на звонки, чтобы "
     "обсудить, кто что понял, а кто что не понял. Абсолютно нормально, если в какой-то части презентации ты скажешь "
     "'автор пишет вот это, я поняла это вот так, но не уверена, что это правильно. Как вы поняли это?'\n\n"
     "Ценность звонков — именно в обсуждении и обмене опытом.\n\n"
     "Когде решишься, просто найди свободный слот в расписании и запишись в "
     "<a href='https://docs.google.com/spreadsheets/d/1qsuaSn0ZkBmldY8hVnKWe41sSgaPG8ekd83csSUh5Qk/edit?gid=0#gid=0'>таблицу</a>. "
     "После звонка пожалуйста оставь ссылку на свои слайды, чтобы другие могли при желании к ним вернуться. "
     "Никого спрашивать и ничего согласовывать не надо.")

mock_leetcode_reminder = \
    "Запишись сегодня, чтобы на выходных пройти leetcode мок-собеседование! Завтра уже будут объявлены пары"

sre_reminder = \
    ("SRE book cозвон через 5 минут! "
     "<a href='https://us06web.zoom.us/j/89699825499?pwd=252HFSD6l5TH2GYm7qDlI3QRahZNIZ.1'> Ссылка на зум!</a>")

leetcode_cta_description = \
    ("Нажми кнопку \"Хочу участвовать\", чтобы бот каждый понедельник присылал тебе тему недели и в каждый четверг "
     "напоминал зарегистрироваться, чтобы участвовать в мок-собеседовании в выходные.")

leetcode_enroll_description = \
    "Бот будет присылать тебе тему недели по понедельникам и напоминание записаться на моки по четвергам!"

leetcode_unenroll_description = "Бот больше не будет присылать тебе напоминания о Leetcode моках"

error_description = \
    "Упс, случилась ошибка в боте. Попробуй заново с команды /start. Я уже оповестил о случившемся Ленку"

leetcode_course_id: int = 7
sre_course_id: int = 8
ddia_4_course_id: int = 10

id_to_course = {7: "Leetcode", 8: "SRE", 10: "DDIA-4"}

leetcode_register_ask_timeslots = ("В какое время можешь созвониться? Время указано по Москве."
                                   "\n\nВыбери хотя бы три слота.")

leetcode_register_timeslots = ['Пятница 19:00', 'Суббота 12:00', 'Суббота 19:00', 'Воскресенье 12:00',
                               'Воскресенье 19:00']
